demo/_site/app/controllers/articles_controller.rb

    def show
        @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

    def create
        @article = Article.new(article_params)

        @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "henry"], ["text", "hebkefbkjsbjsbhdbshbdhbhBD"], ["created_at", "2015-11-10 05:47:50.123912"], ["updated_at", "2015-11-10 05:47:50.123912"]]